[
  {
    "authors": "K Soorya Prakash, PM Gopal, S Karthik",
    "publication_date": "2020/6/1",
    "journal": "Measurement",
    "volume": "157",
    "pages": "107664",
    "publisher": "Elsevier",
    "description": "The present work deals with the optimization of material and machining parameters for surface finish and Material Removal Rate (MRR) enhancements while turning Aluminium/Rock dust composite through Taguchi and Grey Relational Analysis (GRA). Rock dust particles weight percent (5, 10 & 15%) and particle size (10, 20 & 30 μm) are varied accordingly to investigate the effect of reinforcement parameters on composite properties. Along with reinforcement weight % and particle size, also the turning parameters viz. speed, feed and depth of cut are chosen as input parameters with surface roughness (Ra) and MRR as responses. CNC turning is performed based on the L27 orthogonal array designed by Taguchi approach. Results expose that feed has remarkable effect on Ra and MRR rather than any of the other parameters examined. The optimum parameter combination identified through Multi criteria …",
    "total_citations": "121",
    "scholar_articles": "Multi-objective optimization using Taguchi based grey relational analysis in turning of Rock dust reinforced Aluminum MMCKS Prakash, PM Gopal, S Karthik - Measurement, 2020Cited by 121 Related articles All 2 versions",
    "title": "Multi-objective optimization using Taguchi based grey relational analysis in turning of Rock dust reinforced Aluminum MMC",
    "href": "https://www.sciencedirect.com/science/article/pii/S0263224120302025",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:ZeXyd9-uunAC"
  },
  {
    "authors": "S Karthik, P Ram Mohan Rao, PO Awoyera",
    "publication_date": "2017/10/1",
    "journal": "Journal of King Saud University-Engineering Sciences",
    "volume": "29",
    "issue": "4",
    "pages": "400-406",
    "publisher": "Elsevier",
    "description": "In a quest to ensure sustainability of the future generation, various research attempts are focusing on the use of alternative materials for construction. In this study, bamboo strips were used as reinforcement in a concrete that was made with supplementary cementitious materials and partial replacement of river sand with manufactured sand (m-sand). Cement was partially replaced by 25% of combination of admixtures such as fly ash and Ground Granulated Blast Furnace Slag (GGBS). In alignment with standard requirements, concrete samples such as cubes, cylinders and beams were produced and tested at stipulated periods. Micro scale analysis was performed on the bamboo using SEM and FTIR, and its tensile strength was also determined. The results of the micro scale and tensile strength tests revealed that bamboo is a strong and ductile material. The study showed that a combination of fly ash, GGBS and m …",
    "total_citations": "106",
    "scholar_articles": "Strength properties of bamboo and steel reinforced concrete containing manufactured sand and mineral admixturesS Karthik, PRM Rao, PO Awoyera - Journal of King Saud University-Engineering Sciences, 2017Cited by 106 Related articles All 7 versions",
    "title": "Strength properties of bamboo and steel reinforced concrete containing manufactured sand and mineral admixtures",
    "href": "https://www.sciencedirect.com/science/article/pii/S1018363916300484",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:qUcmZB5y_30C"
  },
  {
    "authors": "Muthu Balaanand, N Karthikeyan, S Karthik, R Varatharajan, Gunasekaran Manogaran, CB Sivaparthipan",
    "publication_date": "2019/9",
    "journal": "The Journal of Supercomputing",
    "volume": "75",
    "issue": "9",
    "pages": "6085-6105",
    "publisher": "Springer US",
    "description": "Over the  the past decade, social networking services (SNS) have proliferated on the web. The nature of such sites makes identity deception easy, providing a fast means for creating and managing identities, and then connecting with and deceiving others. Fake users are those accounts specifically created for purposes such as stalking or abuse of another user, for slander, or for marketing. The current system for detecting deception depends on behavioral, non-behavioral and user-generated content (UGC) information gathered from users. Although these methods have high detection accuracy, they cannot be implemented in databases with massive volumes of data. To address this issue, this paper proposes an enhanced graph-based semi-supervised learning algorithm (EGSLA) to detect fake users from a large volume of Twitter data. The proposed method encompasses four modules: data collection …",
    "total_citations": "93",
    "scholar_articles": "An enhanced graph-based semi-supervised learning algorithm to detect fake users on TwitterM Balaanand, N Karthikeyan, S Karthik, R Varatharajan… - The Journal of Supercomputing, 2019Cited by 93 Related articles All 4 versions",
    "title": "An enhanced graph-based semi-supervised learning algorithm to detect fake users on Twitter",
    "href": "https://link.springer.com/article/10.1007/s11227-019-02948-w",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:a0OBvERweLwC"
  },
  {
    "authors": "JT Thirukrishna, S Karthik, VP Arunachalam",
    "publication_date": "2018/4/1",
    "journal": "Future Generation Computer Systems",
    "volume": "81",
    "pages": "331-339",
    "publisher": "North-Holland",
    "description": "Wireless Sensor Networks (WSNs) are often used to monitor the physical world. By using sensor nodes, various types of environmental conditions can be sensed and also it can communicate with the sensed data via wireless communication. The sensor nodes are provided with a battery, and the reduction of the power consumption may lead to the prolonged anticipation of a lifetime of sensor nodes. Researchers worked on sensor nodes to gain energy efficiency and increase its lifetime. Reliable and effective communication among nodes routing algorithms is often used for WSNs. The important objective of routing algorithms is energy saving. Clustering algorithm improves energy efficiency in Homogeneous WSNs. The clustering technique identifies the shortest path, and it is used for cluster head selection. To dissipate energy efficiently, Optimized Radio Energy Algorithm (OREA) is used. Power-Aware Distance …",
    "total_citations": "64",
    "scholar_articles": "Revamp energy efficiency in homogeneous wireless sensor networks using optimized radio energy algorithm (OREA) and power-aware distance source routing protocolJT Thirukrishna, S Karthik, VP Arunachalam - Future Generation Computer Systems, 2018Cited by 64 Related articles All 2 versions",
    "title": "Revamp energy efficiency in homogeneous wireless sensor networks using optimized radio energy algorithm (OREA) and power-aware distance source routing protocol",
    "href": "https://www.sciencedirect.com/science/article/pii/S0167739X17322082",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:maZDTaKrznsC"
  },
  {
    "authors": "M BalaAnand, N Karthikeyan, S Karthik",
    "publication_date": "2020/4",
    "journal": "International Journal of Parallel Programming",
    "volume": "48",
    "issue": "2",
    "pages": "329-343",
    "publisher": "Springer US",
    "description": "Predicting and Identifying behavioral analysis in social media using big data analytics is exceptionally repetitive. Since data in motion are difficult to capture and process with existing innovation. In spite of the fact that there are numerous frameworks that have executed for user behavior analysis, it’s as yet an upcoming and unexplored market that has more prominent potential for better advancements. So with the help of Hadoop framework, a new approach of designing a communal framework is proposed and it’s used for predicting and identifying user’s behavioral analysis in a community. The proposed work can be applied in the community-based environment where the prediction and identification of user behavior analysis has to be made with the semantic web approach. In addition to that, a suitable model for the communally accountable software objects where these objects would observe online …",
    "total_citations": "61",
    "scholar_articles": "RETRACTED ARTICLE: Designing a Framework for Communal Software: Based on the Assessment Using Relation ModellingM BalaAnand, N Karthikeyan, S Karthik - International Journal of Parallel Programming, 2020Cited by 61 Related articles All 6 versions",
    "title": "RETRACTED ARTICLE: Designing a Framework for Communal Software: Based on the Assessment Using Relation Modelling",
    "href": "https://link.springer.com/article/10.1007/s10766-018-0598-2",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:olpn-zPbct0C"
  },
  {
    "authors": "S Karthik, A Muruganandam",
    "publication_date": "2014/11",
    "journal": "International Journal of Scientific Engineering and Research",
    "volume": "2",
    "issue": "11",
    "pages": "24-31",
    "total_citations": "61",
    "scholar_articles": "Data encryption and decryption by using triple DES and performance analysis of crypto systemS Karthik, A Muruganandam - International Journal of Scientific Engineering and …, 2014Cited by 61 Related articles",
    "title": "Data encryption and decryption by using triple DES and performance analysis of crypto system",
    "href": "https://scholar.google.com/scholar?cluster=14158515929198351429&hl=en&oi=scholarr",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:2tRrZ1ZAMYUC"
  },
  {
    "authors": "V Ganesh Karthikeyan, P Thangaraj, S Karthik",
    "publication_date": "2020/12",
    "journal": "Soft Computing",
    "volume": "24",
    "issue": "24",
    "pages": "18477-18487",
    "publisher": "Springer Berlin Heidelberg",
    "description": "Many educational institutions use data mining for maintaining the student records, specifically academic performances, which are more significant. The academic performances of the students are to be analyzed for improving their results and also the overall results of the institutions. Moreover, the prediction of academic performance of students has been an important and developing research domain in educational data mining (EDM), in which data mining and machine learning techniques are used for deriving data from educational warehouse. With that, this paper develops a novel approach called hybrid educational data mining model (HEDM) for analyzing the student performance for effectively enhancing the educational quality for students. The proposed model evaluates the student performances based on distinctive factors that provide appropriate results. Furthermore, the model combines the efficiencies of …",
    "total_citations": "60",
    "scholar_articles": "Towards developing hybrid educational data mining model (HEDM) for efficient and accurate student performance evaluationVG Karthikeyan, P Thangaraj, S Karthik - Soft Computing, 2020Cited by 60 Related articles All 4 versions",
    "title": "Towards developing hybrid educational data mining model (HEDM) for efficient and accurate student performance evaluation",
    "href": "https://link.springer.com/article/10.1007/s00500-020-05075-4",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:GtLg2Ama23sC"
  },
  {
    "authors": "Murad Khan, Kijun Han, SJWPC Karthik",
    "publication_date": "2018/4",
    "journal": "Wireless Personal Communications",
    "volume": "99",
    "pages": "1683-1697",
    "publisher": "Springer US",
    "description": "The Internet of Things (IoT) lay down a platform for global communication among millions of electronic devices connected to the internet. These devices and electronic appliances included both wireless and wired sensors, home appliances such as Television, refrigerator, etc., radio frequency identifications (RFID), and so. Similarly, heterogeneous networks provide a platform for media independent communications. However, there exist several issues in using heterogeneous technologies for IoT communications. These challenges include the co-existence of wireless technologies such as ZigBee, Bluetooth and WIFI, cross-layer communications, high packet loss due to interferences with electronic devices, etc. Similarly, IoT is a new paradigm for interconnecting electronic devices, thus, it needs major refinement for standardising it for various services. In order to address the aforementioned challenges, we …",
    "total_citations": "59",
    "scholar_articles": "Designing smart control systems based on internet of things and big data analyticsM Khan, K Han, S Karthik - Wireless Personal Communications, 2018Cited by 59 Related articles All 3 versions",
    "title": "Designing smart control systems based on internet of things and big data analytics",
    "href": "https://link.springer.com/article/10.1007/s11277-018-5336-y",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:DUooU5lO8OsC"
  },
  {
    "authors": "S Karthik, E Ashok Kumar, P Gowtham, Gokul Elango, D Gokul, S Thangaraj",
    "publication_date": "2014/1",
    "journal": "IOSR Journal of Mechanical and Civil Engineering",
    "volume": "10",
    "issue": "6",
    "pages": "20-26",
    "total_citations": "58",
    "scholar_articles": "Soil stabilization by using fly ashS Karthik, EA Kumar, P Gowtham, G Elango, D Gokul… - IOSR Journal of Mechanical and Civil Engineering, 2014Cited by 58 Related articles",
    "title": "Soil stabilization by using fly ash",
    "href": "https://scholar.google.com/scholar?cluster=6365142767052167084&hl=en&oi=scholarr",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:kzcrU_BdoSEC"
  },
  {
    "authors": "S Karthik, K Soorya Prakash, PM Gopal, Sathiskumar Jothi",
    "publication_date": "2019/5/19",
    "journal": "Materials and Manufacturing Processes",
    "volume": "34",
    "issue": "7",
    "pages": "759-768",
    "publisher": "Taylor & Francis",
    "description": "The current study intends to optimize the wire electric discharge machining (WEDM) parameters while machining the newer AlCoCrFeNiMo0.5 high entropy alloy (HEA) particles-reinforced aluminum composites. AlCoCrFeNiMo0.5 HEA particles produced through arc melting technique are reinforced here for different weight % (0%, 3%, 6%, 9%, 12%, and 15%) along with pure aluminum by the way of powder metallurgy. WEDM studies were conducted by varying the appropriate parameters, namely, pulse ON time, pulse OFF time, and wire feed. Based on the selected parameters, through Taguchi method L18 orthogonal array is designed; the optimal parameter combination for better surface finish, material removal rate (MRR), and reduced kerf width (KW) is identified. For better understanding, through ANOVA, also the effect of each input variables over these adopted response variables was analyzed. The yielded …",
    "total_citations": "54",
    "scholar_articles": "Influence of materials and machining parameters on WEDM of Al/AlCoCrFeNiMo0. 5 MMCS Karthik, KS Prakash, PM Gopal, S Jothi - Materials and Manufacturing Processes, 2019Cited by 54 Related articles All 2 versions",
    "title": "Influence of materials and machining parameters on WEDM of Al/AlCoCrFeNiMo0.5 MMC",
    "href": "https://www.tandfonline.com/doi/abs/10.1080/10426914.2019.1594250",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:mNrWkgRL2YcC"
  },
  {
    "authors": "Shanmugam Karthik, Thirumanavelan Gandhi",
    "publication_date": "2017/10/6",
    "journal": "Organic letters",
    "volume": "19",
    "issue": "19",
    "pages": "5486-5489",
    "publisher": "American Chemical Society",
    "description": "N-Acylsaccharin represents a facile acyl group transfer agent to heteroarenes in the presence of Pd(II)/NHC complexes appended with a pyrene unit. Catalytic acylation of heteroarenes was enhanced by the noncovalent interaction between the pyrene unit and substrates. High functional group tolerance, broad substrate scope, and moderate to good yields of 2-acylated azoles are added features of this method.",
    "total_citations": "50",
    "scholar_articles": "Palladium (II)/N-heterocyclic carbene-catalyzed direct C–H acylation of heteroarenes with N-acylsaccharinsS Karthik, T Gandhi - Organic letters, 2017Cited by 50 Related articles All 7 versions",
    "title": "Palladium(II)/N-Heterocyclic Carbene-Catalyzed Direct C–H Acylation of Heteroarenes with N-Acylsaccharins",
    "href": "https://pubs.acs.org/doi/abs/10.1021/acs.orglett.7b02877",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:3htObqc8RwsC"
  },
  {
    "authors": "CB Sivaparthipan, N Karthikeyan, S Karthik",
    "publication_date": "2020/4",
    "journal": "Multimedia Tools and Applications",
    "volume": "79",
    "issue": "13",
    "pages": "8431-8444",
    "publisher": "Springer US",
    "description": "Health services research provides a multi-disciplinary area of scientific exploration in relation to financial systems, social factors, organizational processes, and health technologies. With the help of big data, the huge amount of data can well be stored and handled effectively for diagnosis and also proper treatment of diseases can be monitored with these emerging technologies. In recent years, Diabetes Mellitus is non-transmittable illnesses that are a matter of concern in most of the developing countries. This paper proposes a model of a statistical assessment, healthcare information system for Diabetes Analysis employing big data. The performance metric such as accuracy and F-measure for the proposed statistical assessment model is evaluated by Hadoop framework, the results are comparatively higher than existing methods.",
    "total_citations": "47",
    "scholar_articles": "RETRACTED ARTICLE: Designing statistical assessment healthcare information system for diabetics analysis using big dataCB Sivaparthipan, N Karthikeyan, S Karthik - Multimedia Tools and Applications, 2020Cited by 47 Related articles All 5 versions",
    "title": "RETRACTED ARTICLE: Designing statistical assessment healthcare information system for diabetics analysis using big data",
    "href": "https://link.springer.com/article/10.1007/s11042-018-6648-3",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:08ZZubdj9fEC"
  },
  {
    "authors": "Sundaravadivelu Karthik, Kaliyaperumal Saravana Raja Mohan",
    "publication_date": "2021/10/22",
    "journal": "Crystals",
    "volume": "11",
    "issue": "11",
    "pages": "1279",
    "publisher": "MDPI",
    "description": "In recent decades, geopolymer concrete (GPC) has been extensively researched as a potential substitute sustainable building material that may reduce CO2 emissions due to its utilization of industrial by-products. Fly ash (FA) and ground-granulated blast-furnace slag (GGBFS) are preferred geopolymer raw materials due to their obtainability and high alumina and silica concentrations. GGBFS-FA based GPC offers a clean and sustainable development technology alternative. In this study, the Taguchi method was used to optimize the mixed proportions of geopolymer concrete to achieve desired strength criteria. Four factors and four levels were considered: binder content, including four combinations of FA and GGFBS dosage, dosage of superplasticizer (0.5, 1.0, 1.5 and 2%), Na2SiO3/NaOH ratio (1.5, 2.0, 2.5 and 3), and molarity (6, 8, 10 and 12). Using these ingredients and factors, the effect of compressive strength was examined. The Taguchi approach using an L16 orthogonal array was employed to find the optimum condition of every factor while limiting the number of experiments. The findings indicated that the optimum synthesis conditions for maximum compressive strength obtained from the binder comprised 45% of FA, 45% of GGBFS and 10% of silica fume, 1.5% dosage of superplasticizer, Na2SiO3/NaOH ratio = 1.5, and 12 molar contents.",
    "total_citations": "42",
    "scholar_articles": "A taguchi approach for optimizing design mixture of geopolymer concrete incorporating fly ash, ground granulated blast furnace slag and silica fumeS Karthik, KSR Mohan - Crystals, 2021Cited by 42 Related articles All 3 versions",
    "title": "A taguchi approach for optimizing design mixture of geopolymer concrete incorporating fly ash, ground granulated blast furnace slag and silica fume",
    "href": "https://www.mdpi.com/2073-4352/11/11/1279",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:IWHjjKOFINEC"
  },
  {
    "authors": "P Amudha, S Karthik, S Sivakumari",
    "publication_date": "2015",
    "journal": "The Scientific World Journal",
    "volume": "2015",
    "issue": "1",
    "pages": "574589",
    "publisher": "Hindawi Publishing Corporation",
    "description": "Intrusion detection has become a main part of network security due to the huge number of attacks which affects the computers. This is due to the extensive growth of internet connectivity and accessibility to information systems worldwide. To deal with this problem, in this paper a hybrid algorithm is proposed to integrate Modified Artificial Bee Colony (MABC) with Enhanced Particle Swarm Optimization (EPSO) to predict the intrusion detection problem. The algorithms are combined together to find out better optimization results and the classification accuracies are obtained by 10‐fold cross‐validation method. The purpose of this paper is to select the most relevant features that can represent the pattern of the network traffic and test its effect on the success of the proposed hybrid classification algorithm. To investigate the performance of the proposed method, intrusion detection KDDCup’99 benchmark dataset from the …",
    "total_citations": "41",
    "scholar_articles": "A hybrid swarm intelligence algorithm for intrusion detection using significant featuresP Amudha, S Karthik, S Sivakumari - The Scientific World Journal, 2015Cited by 41 Related articles All 11 versions",
    "title": "A hybrid swarm intelligence algorithm for intrusion detection using significant features",
    "href": "https://onlinelibrary.wiley.com/doi/abs/10.1155/2015/574589",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:pAkWuXOU-OoC"
  },
  {
    "authors": "K Ganga, S Karthik",
    "publication_date": "2013/2/21",
    "conference": "2013 International Conference on Pattern Recognition, Informatics and Mobile Engineering",
    "pages": "387-390",
    "publisher": "IEEE",
    "description": "Fault Tolerance is a configuration that prevents a computer or network device from failing in the event of unexpected problem or error such as hardware failure, link failure, unauthorized access, variations in the configuration of different systems and system running out of memory or disk space. The integration of fault tolerance measures with scheduling gains much importance. Scientific workflows use distributed heterogeneous resources in cloud interface are often hard to program. This paper explains task replication technique and simulation of cloud computing systems.",
    "total_citations": "41",
    "scholar_articles": "A fault tolerent approach in scientific workflow systems based on cloud computingK Ganga, S Karthik - 2013 International Conference on Pattern Recognition …, 2013Cited by 41 Related articles All 2 versions",
    "title": "A fault tolerent approach in scientific workflow systems based on cloud computing",
    "href": "https://ieeexplore.ieee.org/abstract/document/6496507/",
    "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=flp93UcAAAAJ&citation_for_view=flp93UcAAAAJ:fFSKOagxvKUC"
  }
]